In [0]:
import numpy as np 
import pandas as pd

In [7]:
a_ascii = ord('A')#Creating a series
z_ascii = ord('Z')
alphabets = [chr(i) for i in range(a_ascii, z_ascii+1)]

print(alphabets)

numbers = np.arange(26)

print(numbers)

print(type(alphabets), type(numbers))

alpha_numbers = dict(zip(alphabets, numbers))

print(alpha_numbers)

print(type(alpha_numbers))

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25]
<class 'list'> <class 'numpy.ndarray'>
{'A': 0, 'B': 1, 'C': 2, 'D': 3, 'E': 4, 'F': 5, 'G': 6, 'H': 7, 'I': 8, 'J': 9, 'K': 10, 'L': 11, 'M': 12, 'N': 13, 'O': 14, 'P': 15, 'Q': 16, 'R': 17, 'S': 18, 'T': 19, 'U': 20, 'V': 21, 'W': 22, 'X': 23, 'Y': 24, 'Z': 25}
<class 'dict'>

In [8]:
series1 = pd.Series(alphabets)
print(series1)

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
11    L
12    M
13    N
14    O
15    P
16    Q
17    R
18    S
19    T
20    U
21    V
22    W
23    X
24    Y
25    Z
dtype: object

In [9]:
series2 = pd.Series(numbers)
print(series2)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int64

In [12]:
series3 = pd.Series(alpha_numbers)
print(series3)

A     0
B     1
C     2
D     3
E     4
F     5
G     6
H     7
I     8
J     9
K    10
L    11
M    12
N    13
O    14
P    15
Q    16
R    17
S    18
T    19
U    20
V    21
W    22
X    23
Y    24
Z    25
dtype: int64

In [13]:
#replace head() with head(n) where n can be any number between [0-25] and observe the output in deach case 
series3.head()

A    0
B    1
C    2
D    3
E    4
dtype: int64

Creating a dataframe

In [14]:
data = {'alphabets': alphabets, 'values': numbers}

df = pd.DataFrame(data)

df

   alphabets  values
0          A       0
1          B       1
2          C       2
3          D       3
4          E       4
5          F       5
6          G       6
7          H       7
8          I       8
9          J       9
10         K      10
11         L      11
12         M      12
13         N      13
14         O      14
15         P      15
16         Q      16
17         R      17
18         S      18
19         T      19
20         U      20
21         V      21
22         W      22
23         X      23
24         Y      24
25         Z      25

In [15]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,16,17,18,19,20,21,22,23,24,25
alphabets,A,B,C,D,E,F,G,H,I,J,...,Q,R,S,T,U,V,W,X,Y,Z
values,0,1,2,3,4,5,6,7,8,9,...,16,17,18,19,20,21,22,23,24,25

In [16]:
df.columns=['alphabets','alpha_numbers']
df

   alphabets  alpha_numbers
0          A              0
1          B              1
2          C              2
3          D              3
4          E              4
5          F              5
6          G              6
7          H              7
8          I              8
9          J              9
10         K             10
11         L             11
12         M             12
13         N             13
14         O             14
15         P             15
16         Q             16
17         R             17
18         S             18
19         T             19
20         U             20
21         V             21
22         W             22
23         X             23
24         Y             24
25         Z             25

Extract Items from a series

In [17]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

vowels = ser.take(pos)

df = pd.DataFrame(vowels)

df.columns = ['vowels']

df.index = [0, 1, 2, 3, 4]

df

  vowels
0      a
1      e
2      i
3      o
4      u

Change the first character of each word to upper case in each word of ser

In [18]:
ser = pd.Series(['I', 'am', 'learning', 'pandas'])

ser.map(lambda x : x.title())

titles = [i.title() for i in ser]

titles

['I', 'Am', 'Learning', 'Pandas']

Reindexxing

In [19]:
myind = [10, 20, 30, 40, 50]

df1 = pd.DataFrame({'UPval': ['A', 'B', 'C', 'D', 'E'],
                   'Lowval': ['a', 'b', 'c', 'd', 'e']},
                  index = myind)

df1

   Lowval UPval
10      a     A
20      b     B
30      c     C
40      d     D
50      e     E

In [21]:
new=[10,30,50,40,20]
df1.reindex(index=new)

   Lowval UPval
10      a     A
30      c     C
50      e     E
40      d     D
20      b     B